/**
 * Статическое хранилище данных функционала печати документов сделок.
 *
 * id - Вид документа:
 * 1 - Акт
 * 3 - Счет
 * 4 - Счет-фактура (до 1.07.21)
 * 5 - Торг-12
 * 6 - Накладная на отпуск товаров (не используется)
 * 7 - Накладная на отпуск материалов на сторону
 * 8 - Счет-фактура авансовая (до 1.07.21)
 * 9 - Квитанция
 * 10 - Доверенность
 * 15 - ТТН
 * 16 - КС2
 * 17 - КС3
 * 18 - УПД (до 1.07.21)
 * 19 - Счет-фактура корректировочная (до 1.07.21)
 * 21 - Товарный чек
 * 22 - Договор оказания услуг
 * 23 - Договор купли-продажи
 * 26 - Счет-фактура комитента (до 1.07.21)
 * 27 - Счет-фактура принципала (до 1.07.21)
 * 28 - Акт приема-передачи
 * 104 - Счет-фактура для непрослеживаемых (после 1.07.21)
 * 110 - Форма М-2
 * 118 - УПД для непрослеживаемых (после 1.07.21)
 * 119 - СФ корректировочная для непрослеживаемых (после 1.07.21)
 * 126 - Счет-фактура комитента для непрослеживаемых (после 1.07.21)
 * 127 - Счет-фактура принципала для непрослеживаемых (после 1.07.21)
 * 204 - Счет-фактура для прослеживаемых (после 1.07.21)
 * 210 - Форма М-2а
 * 218 - УПД для прослеживаемых (после 1.07.21)
 * 219 - СФ корректировочная для прослеживаемых (после 1.07.21)
 * 226 - Счет-фактура комитента для прослеживаемых (после 1.07.21)
 * 227 - Счет-фактура принципала для прослеживаемых (после 1.07.21)
 *
 * #GBS-8394
 * 08.2020
 */
Ext.define('Buh.store.global.DealDocPrintStore', {
    extend: 'Ext.data.Store',
    model: 'Buh.model.global.DealDocPrint',
    proxy: {
        type: 'memory',
        reader: {
            type: 'json',
            root: 'data'
        }
    },
    data: [
        { 'id': 1, 'url': 'frm_akt.php' },
        { 'id': 3, 'url': 'frm_schet.php' },
        { 'id': 4, 'url': 'frm_schetf_10.php' },
        { 'id': 5, 'url': 'frm_nakl.bak.php' },
        { 'id': 6, 'url': 'frm_nakl_tov.php' },
        { 'id': 7, 'url': 'frm_nakl_mat.php' },
        { 'id': 8, 'url': 'frm_schetf_av_10.php' },
        { 'id': 9, 'url': 'frm_kvit.php' },
        { 'id': 10, 'url': 'frm_dov.php' },
        { 'id': 15, 'url': 'frm_ttn.php' },
        { 'id': 16, 'url': 'frm_ks2.php' },
        { 'id': 17, 'url': 'frm_ks3.php' },
        { 'id': 18, 'url': 'frm_upd_10.php' },
        { 'id': 19, 'url': 'frm_schetfc_10.php' },
        { 'id': 21, 'url': 'frm_tov_check_action.php' },
        { 'id': 22, 'url': 'frm_agreement.php' },
        { 'id': 23, 'url': 'frm_agreement.php' },
        { 'id': 26, 'url': 'frm_schetf_10.php' },
        { 'id': 27, 'url': 'frm_schetf_10.php' },
        { 'id': 28, 'url': 'frm_akt.php' },

        { 'id': 104, 'url': 'frm_schetf_10_notr_21.php' },
        { 'id': 118, 'url': 'frm_upd_10_notr_21.php' },
        { 'id': 119, 'url': 'frm_schetfc_10_notr_21.php' },
        { 'id': 126, 'url': 'frm_schetf_10_notr_21.php' },
        { 'id': 127, 'url': 'frm_schetf_10_notr_21.php' },

        { 'id': 110, 'url': 'frm_dov_m2_21.php' },
        { 'id': 210, 'url': 'frm_dov_m2a_21.php' },

        { 'id': 204, 'url': 'frm_schetf_10_21.php' },
        { 'id': 218, 'url': 'frm_upd_10_21.php' },
        { 'id': 219, 'url': 'frm_schetfc_10_21.php' },
        { 'id': 226, 'url': 'frm_schetf_10_21.php' },
        { 'id': 227, 'url': 'frm_schetf_10_21.php' },
    ]
});
